one_Blade_Case/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;
motionSolverLibs ("libdynamicMesh.so");
solver		multiSolidBodyMotionSolver;


bladeAMICellZone0
{
	solidBodyMotionFunction multiMotion;
	rotatingMotion
	{
		solidBodyMotionFunction  rotatingNoF1IntegrationMotion;
		rotatingNoF1IntegrationMotionCoeffs
		{
			origin        (0 0 0);
			axis          (0 0 1);
			omega
			{

				type            scale;
				scale           linearRamp;
				scaleCoeffs
					{
						start           12e-4;
						duration        96e-4;
					}
				value 18.67;
			}
		}
	}
	pitchingMotion  /// this instruction MUST come after rotor motion, otherwise the center of rotation is wrong
	{
		solidBodyMotionFunction  TrimMotion;
		origin        (0.5 0 0);
		amplitude     (0 0 -25);  // degs
		initialOffset 	0; // offset of foil oscillation at t=0, multiple of pi, in rad
		omega_value	18.67;
		#include "../system/Oscillations"
		PatchName	"_Blade1";
		omega
		{
			type            scale;
			scale           linearRamp;
			scaleCoeffs
				{
					start           12e-4;
					duration        96e-4;
				}
			value 18.67;
			
		}
	}
}
